# -*- coding: utf-8 -*-
#+TITLE: EZPWD Reed-Solomon
#+EXPORT_FILE_NAME: README.pdf
#+STARTUP: org-startup-with-inline-images inlineimages

#+OPTIONS: ^:nil # Disable sub/superscripting with bare _; _{...} still works
#+OPTIONS: toc:nil

#+LATEX_HEADER: \usepackage[margin=1.0in]{geometry}

#+BEGIN_ABSTRACT
Implements C++ classes for compile-time optimized Reed-Solomon and BCH codecs.
#+END_ABSTRACT

#+TOC: headlines 3

** =ezpwd_reed_solomon.BCH=

   The BCH module provides several BCH codec classes.  Presently, all are
   implemented using Ivan Djelic's implementation, straight from the Linux
   kernel.

   The basic API (provided in =bch_base=) is specified in terms of Galois field
   order 'm' (from 5-9), and bit-error correction capacity 't'.  A BCH codec is
   provided (if possible) with the specified capacity.  The BCH codeword size is
   2^m-1, and the number of ECC bits required to achieve bit-error correction
   capacity 't' is computed.  Thus, the resultant =codec='s data payload
   capacity could be computed using:
   : 2 ** m - 1 - codec.ecc_bits()

   | Class                   | Description                                    |
   |-------------------------+------------------------------------------------|
   | =bch_base=              | Obtain a BCH codec by specifying M             |
   |                         | (Galois order; codeword size == 2^M-1) and     |
   |                         | T (bit-error correction capacity)              |
   |                         |                                                |
   | =bch_255_<T>=           | Specify a pre-defined codeword size            |
   | - =bch_255_1=           | (2^M-1), and bit-error capacity T              |
   | - =bch_255_2=           |                                                |
   | - =bch_255_3=           |                                                |
   | - =bch_255_4=           |                                                |
   | - =bch_255_5=           |                                                |
   | - =bch_255_6=           |                                                |
   | - =bch_255_7=           |                                                |
   | - =bch_255_8=           |                                                |
   |                         |                                                |
   | =BCH_255_<PAYLOAD>-<T>= | Specific BCH codec by fully specifying         |
   | - =BCH_255_191_8=       | the Codeword, Payload and T bit-error capacity |
   | - =BCH_255_199_7=       |                                                |
   | - =BCH_255_207_6=       |                                                |
   | - =BCH_255_215_5=       |                                                |
   | - =BCH_255_223_4=       |                                                |
   | - =BCH_255_231_3=       |                                                |
   | - =BCH_255_239_2=       |                                                |
   | - =BCH_255_247_1=       |                                                |

   In the future, the BCH.BCH_... version may be re-implemented using C++
   templates, to provide optimizations available due to the predetermined fixed
   size of internal tables.  Therefore, it is recommended that the fixed
   BCH_... version be used if possible.
  
   All codecs provide:
  
   | Method        | Description                                                            |
   |---------------+------------------------------------------------------------------------|
   | =t()=         | The bit-error correction capacity                                      |
   | =ecc_bits()=  | The number of BCH parity bits                                          |
   | =ecc_bytes()= | The number of BCH parity bytes                                         |
   | =encoded()=   | Return the BCH encoded data, w/ ECC bytes appended                     |
   | =decoded()=   | Return the BCH decoded and corrected data (*not* discarding ECC bytes) |
  
   Here's some sample code illustrating some simple use-cases for the
   =ezpwd_reed_solomon.BCH= module:
  
   #+LATEX: {\footnotesize
   #+BEGIN_SRC ipython :session :exports both
     from ezpwd_reed_solomon import BCH
   
     def flip( data, bit ):
       if isinstance( data, str ):
         return data[:bit // 8] + chr( ord( data[bit // 8] ) ^ 1 << bit % 8) + data[bit // 8 + 1:]
       elif isinstance( data, tuple ):
         return data[:bit // 8] + (data[bit // 8] ^ 1 << bit % 8,) + data[bit // 8 + 1:]
       elif isinstance( data, list ):
         return data[:bit // 8] + [data[bit // 8] ^ 1 << bit % 8,] + data[bit // 8 + 1:]
       raise RuntimeError( "Unhandled sequence: %r" % data )
   
     flexi16 = BCH.bch_base( 8, 2 )
   
     ori = 'abc'
     enc = flexi16.encoded( ori )
  
     # Add some bit-errors
     err = flip( enc, 14 )
     err = flip( err, 7 )
     #err = flip( err, 21 ) # over bit-error correction capacity
  
     # Decode and test
     dec = flexi16.decoded( err )
     assert dec[:3] == ori
  
     # The error positions can be returned; a special BCH.error_position container type
     # must be used (due to the vagaries of the Swig-generated Python wrapper).
     data = [0x01, 0x23, 0x45, 0x67, 0x89, 0xAB, 0xCD, 0xEF]
     codeword = flexi16.encoded( data )
  
     erroneous = list( codeword )
     erroneous[1] ^= 1 << 3 # introduce an error in the 4rd bit of the 2nd byte; 12th bit (bit index 11)
     positions = BCH.error_position()
     corrected = flexi16.decoded( erroneous, positions )
     assert corrected == codeword and len( positions ) == 1 and positions[0] == 11, \
       "'codeword:  %r'\n'erroneous: %r'\n'corrected: %r'\n'positions: %r'" % (
         codeword, erroneous, corrected, list( positions ))
     "'codeword:  %r'\n'erroneous: %r'\n'corrected: %r'\n'positions: %r'" % (
       codeword, erroneous, corrected, list( positions ))
  
   #+END_SRC
  
   #+RESULTS:
   : 'codeword:  (1, 35, 69, 103, 137, 171, 205, 239, 203, 187)'
   : 'erroneous: [1, 43, 69, 103, 137, 171, 205, 239, 203, 187]'
   : 'corrected: (1, 35, 69, 103, 137, 171, 205, 239, 203, 187)'
   : 'positions: [11]'

   #+LATEX: }

